## Terraform Plan — Production

<details>
<summary>Click to expand plan output</summary>

```hcl
data.aws_ssm_parameter.api_token: Reading...
module.network.data.aws_region.current: Reading...
data.aws_ecr_repository.worker[0]: Reading...
module.ecs_service_worker.aws_cloudwatch_log_group.service: Refreshing state... [id=/ecs/exam-costa-production-worker]
module.iam_api_task_role.aws_iam_role.this: Refreshing state... [id=exam-costa-production-api-task-role]
module.network.aws_vpc.main: Refreshing state... [id=vpc-067e0daa18672ab26]
module.sqs_messages.aws_sqs_queue.dlq[0]: Refreshing state... [id=https://sqs.us-east-2.amazonaws.com/371670420772/exam-costa-production-messages-dlq]
data.aws_caller_identity.current: Reading...
module.iam_ecs_execution_role.aws_iam_role.this: Refreshing state... [id=exam-costa-production-ecs-execution-role]
module.iam_worker_task_role.aws_iam_role.this: Refreshing state... [id=exam-costa-production-worker-task-role]
module.network.data.aws_region.current: Read complete after 0s [id=us-east-2]
data.aws_ecr_repository.api[0]: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=371670420772]
module.ecs_cluster.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:us-east-2:371670420772:cluster/exam-costa-production-cluster]
module.ecs_service_api.aws_cloudwatch_log_group.service: Refreshing state... [id=/ecs/exam-costa-production-api]
data.aws_ssm_parameter.api_token: Read complete after 0s [id=/exam-costa/production/api/token]
module.sqs_messages.aws_sqs_queue.main: Refreshing state... [id=https://sqs.us-east-2.amazonaws.com/371670420772/exam-costa-production-messages]
module.s3_messages.aws_s3_bucket.this: Refreshing state... [id=exam-costa-production-messages-371670420772]
module.ecs_cluster.aws_ecs_cluster_capacity_providers.main: Refreshing state... [id=exam-costa-production-cluster]
aws_cloudwatch_metric_alarm.sqs_queue_depth[0]: Refreshing state... [id=exam-costa-production-sqs-queue-depth]
module.iam_ecs_execution_role.aws_iam_role_policy_attachment.managed[0]: Refreshing state... [id=exam-costa-production-ecs-execution-role-20260329020634331800000001]
data.aws_ecr_repository.worker[0]: Read complete after 0s [id=exam-costa-worker]
data.aws_ecr_repository.api[0]: Read complete after 0s [id=exam-costa-api]
module.iam_api_task_role.aws_iam_role_policy.inline["ssm_access"]: Refreshing state... [id=exam-costa-production-api-task-role:ssm_access]
module.iam_api_task_role.aws_iam_role_policy.inline["sqs_send"]: Refreshing state... [id=exam-costa-production-api-task-role:sqs_send]
module.ecs_service_api.aws_ecs_task_definition.main: Refreshing state... [id=exam-costa-production-api]
module.s3_messages.aws_s3_bucket_versioning.this: Refreshing state... [id=exam-costa-production-messages-371670420772]
module.ecs_service_worker.aws_ecs_task_definition.main: Refreshing state... [id=exam-costa-production-worker]
module.s3_messages.aws_s3_bucket_server_side_encryption_configuration.this: Refreshing state... [id=exam-costa-production-messages-371670420772]
module.iam_worker_task_role.aws_iam_role_policy.inline["sqs_receive"]: Refreshing state... [id=exam-costa-production-worker-task-role:sqs_receive]
module.iam_worker_task_role.aws_iam_role_policy.inline["s3_upload"]: Refreshing state... [id=exam-costa-production-worker-task-role:s3_upload]
module.s3_messages.aws_s3_bucket_lifecycle_configuration.this[0]: Refreshing state... [id=exam-costa-production-messages-371670420772]
module.network.aws_subnet.private[1]: Refreshing state... [id=subnet-0aaa1811dba41e9a4]
module.network.aws_subnet.public[1]: Refreshing state... [id=subnet-000e429fa7c32b15f]
module.network.aws_internet_gateway.main: Refreshing state... [id=igw-095fca6bd6d2590f3]
module.network.aws_subnet.public[0]: Refreshing state... [id=subnet-0a0458182fd609f95]
module.network.aws_route_table.public: Refreshing state... [id=rtb-0cdea77588eaa76cd]
aws_security_group.alb: Refreshing state... [id=sg-0d145d38225856f47]
module.network.aws_route_table.private[0]: Refreshing state... [id=rtb-0e4fdcb923818faee]
module.network.aws_subnet.private[0]: Refreshing state... [id=subnet-0b52860388deffe80]
aws_security_group.worker_service: Refreshing state... [id=sg-0e41a8c7e34a85334]
module.alb.aws_lb_target_group.main: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:371670420772:targetgroup/exam-costa-production-alb-tg/a0a346fcc64fe801]
module.network.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0346952372c111e08]
aws_security_group.api_service: Refreshing state... [id=sg-01a70e18bcf3af7b9]
module.network.aws_route.public_internet_gateway: Refreshing state... [id=r-rtb-0cdea77588eaa76cd1080289494]
module.network.aws_vpc_endpoint.s3[0]: Refreshing state... [id=vpce-05bf885d6b7941237]
module.network.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-03aa2c1de3c77fe44]
module.network.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0d6fa3effe2aee3b7]
module.network.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-02e2f1d0878f97e59]
module.network.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-02aca4e52672314dd]
module.alb.aws_lb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:371670420772:loadbalancer/app/exam-costa-production-alb/8b3211962fbfe865]
module.ecs_service_worker.aws_ecs_service.main: Refreshing state... [id=arn:aws:ecs:us-east-2:371670420772:service/exam-costa-production-cluster/exam-costa-production-worker]
module.network.aws_nat_gateway.main[0]: Refreshing state... [id=nat-091236ba60d259488]
module.ecs_service_api.aws_ecs_service.main: Refreshing state... [id=arn:aws:ecs:us-east-2:371670420772:service/exam-costa-production-cluster/exam-costa-production-api]
module.network.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0e4fdcb923818faee1080289494]
aws_ssm_parameter.infra_output["api_service_name"]: Refreshing state... [id=/exam-costa/production/outputs/api_service_name]
aws_ssm_parameter.infra_output["alb_url"]: Refreshing state... [id=/exam-costa/production/outputs/alb_url]
aws_ssm_parameter.infra_output["worker_service_name"]: Refreshing state... [id=/exam-costa/production/outputs/worker_service_name]
aws_ssm_parameter.infra_output["ecs_cluster_name"]: Refreshing state... [id=/exam-costa/production/outputs/ecs_cluster_name]
module.alb.aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:371670420772:listener/app/exam-costa-production-alb/8b3211962fbfe865/91b866ec4ce7621c]
aws_ssm_parameter.infra_output["sqs_queue_url"]: Refreshing state... [id=/exam-costa/production/outputs/sqs_queue_url]
aws_ssm_parameter.infra_output["s3_bucket_name"]: Refreshing state... [id=/exam-costa/production/outputs/s3_bucket_name]
aws_cloudwatch_dashboard.main[0]: Refreshing state... [id=exam-costa-production]
aws_cloudwatch_metric_alarm.alb_unhealthy_targets[0]: Refreshing state... [id=exam-costa-production-alb-unhealthy-targets]
aws_ssm_parameter.cloudwatch_dashboard_url[0]: Refreshing state... [id=/exam-costa/production/outputs/cloudwatch_dashboard_url]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_acm_certificate.self_signed will be created
  + resource "aws_acm_certificate" "self_signed" {
      + arn                       = (known after apply)
      + certificate_body          = (known after apply)
      + domain_name               = (known after apply)
      + domain_validation_options = (known after apply)
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + private_key               = (sensitive value)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + tags                      = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "exam-costa-production-self-signed-cert"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + tags_all                  = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "exam-costa-production-self-signed-cert"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = (known after apply)
    }

  # aws_ssm_parameter.infra_output["alb_url"] will be updated in-place
  ~ resource "aws_ssm_parameter" "infra_output" {
        id             = "/exam-costa/production/outputs/alb_url"
      + insecure_value = (known after apply)
        name           = "/exam-costa/production/outputs/alb_url"
        tags           = {
            "CostCenter"  = "devops-exam"
            "Environment" = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "/exam-costa/production/outputs/alb_url"
            "Owner"       = "costa"
            "Project"     = "DevOps Exam Costa"
            "Purpose"     = "exam-submission"
        }
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # tls_private_key.self_signed will be created
  + resource "tls_private_key" "self_signed" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

  # tls_self_signed_cert.self_signed will be created
  + resource "tls_self_signed_cert" "self_signed" {
      + allowed_uses          = [
          + "key_encipherment",
          + "digital_signature",
          + "server_auth",
        ]
      + cert_pem              = (known after apply)
      + early_renewal_hours   = 0
      + id                    = (known after apply)
      + is_ca_certificate     = false
      + key_algorithm         = (known after apply)
      + max_path_length       = (known after apply)
      + private_key_pem       = (sensitive value)
      + ready_for_renewal     = false
      + set_authority_key_id  = false
      + set_subject_key_id    = false
      + validity_end_time     = (known after apply)
      + validity_period_hours = 8760
      + validity_start_time   = (known after apply)

      + subject {
          + common_name  = "exam-costa-production.internal"
          + organization = "exam-costa"
        }
    }

  # module.alb.aws_lb_listener.http will be updated in-place
  ~ resource "aws_lb_listener" "http" {
        id                                   = "arn:aws:elasticloadbalancing:us-east-2:371670420772:listener/app/exam-costa-production-alb/8b3211962fbfe865/91b866ec4ce7621c"
        tags                                 = {
            "CostCenter"  = "devops-exam"
            "Environment" = "production"
            "ManagedBy"   = "terraform"
            "Owner"       = "costa"
            "Project"     = "DevOps Exam Costa"
            "Purpose"     = "exam-submission"
        }
        # (6 unchanged attributes hidden)

      ~ default_action {
          ~ type             = "forward" -> "redirect"
            # (2 unchanged attributes hidden)

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # module.alb.aws_lb_listener.https[0] will be created
  + resource "aws_lb_listener" "https" {
      + arn                                                                   = (known after apply)
      + certificate_arn                                                       = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = "arn:aws:elasticloadbalancing:us-east-2:371670420772:loadbalancer/app/exam-costa-production-alb/8b3211962fbfe865"
      + port                                                                  = 443
      + protocol                                                              = "HTTPS"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = "ELBSecurityPolicy-TLS-1-2-2017-01"
      + tags                                                                  = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + tags_all                                                              = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-2:371670420772:targetgroup/exam-costa-production-alb-tg/a0a346fcc64fe801"
          + type             = "forward"
        }
    }

  # module.ecs_service_api.aws_ecs_service.main will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        id                                 = "arn:aws:ecs:us-east-2:371670420772:service/exam-costa-production-cluster/exam-costa-production-api"
        name                               = "exam-costa-production-api"
        tags                               = {
            "CostCenter"  = "devops-exam"
            "Environment" = "production"
            "ManagedBy"   = "terraform"
            "Owner"       = "costa"
            "Project"     = "DevOps Exam Costa"
            "Purpose"     = "exam-submission"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-2:371670420772:task-definition/exam-costa-production-api:2" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs_service_api.aws_ecs_task_definition.main must be replaced
-/+ resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:us-east-2:371670420772:task-definition/exam-costa-production-api:2" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-2:371670420772:task-definition/exam-costa-production-api" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image            = "371670420772.dkr.ecr.us-east-2.amazonaws.com/exam-costa-api:v1.5.0" -> "371670420772.dkr.ecr.us-east-2.amazonaws.com/exam-costa-api:v2.0.0"
                    name             = "api"
                  ~ portMappings     = [
                      ~ {
                          - hostPort      = 8000
                            # (2 unchanged attributes hidden)
                        },
                    ]
                  - systemControls   = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "exam-costa-production-api" -> (known after apply)
      ~ revision                 = 2 -> (known after apply)
        tags                     = {
            "CostCenter"  = "devops-exam"
            "Environment" = "production"
            "ManagedBy"   = "terraform"
            "Owner"       = "costa"
            "Project"     = "DevOps Exam Costa"
            "Purpose"     = "exam-submission"
        }
        # (10 unchanged attributes hidden)
    }

  # module.ecs_service_worker.aws_ecs_service.main will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        id                                 = "arn:aws:ecs:us-east-2:371670420772:service/exam-costa-production-cluster/exam-costa-production-worker"
        name                               = "exam-costa-production-worker"
        tags                               = {
            "CostCenter"  = "devops-exam"
            "Environment" = "production"
            "ManagedBy"   = "terraform"
            "Owner"       = "costa"
            "Project"     = "DevOps Exam Costa"
            "Purpose"     = "exam-submission"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-2:371670420772:task-definition/exam-costa-production-worker:2" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.ecs_service_worker.aws_ecs_task_definition.main must be replaced
-/+ resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:us-east-2:371670420772:task-definition/exam-costa-production-worker:2" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-2:371670420772:task-definition/exam-costa-production-worker" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image            = "371670420772.dkr.ecr.us-east-2.amazonaws.com/exam-costa-worker:v1.5.0" -> "371670420772.dkr.ecr.us-east-2.amazonaws.com/exam-costa-worker:v2.0.0"
                    name             = "worker"
                  - systemControls   = []
                    # (8 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "exam-costa-production-worker" -> (known after apply)
      ~ revision                 = 2 -> (known after apply)
        tags                     = {
            "CostCenter"  = "devops-exam"
            "Environment" = "production"
            "ManagedBy"   = "terraform"
            "Owner"       = "costa"
            "Project"     = "DevOps Exam Costa"
            "Purpose"     = "exam-submission"
        }
        # (10 unchanged attributes hidden)
    }

Plan: 6 to add, 4 to change, 2 to destroy.

Changes to Outputs:
  ~ api_task_definition_arn    = "arn:aws:ecs:us-east-2:371670420772:task-definition/exam-costa-production-api:2" -> (known after apply)
  ~ deployment_info            = {
      ~ api_image    = "371670420772.dkr.ecr.us-east-2.amazonaws.com/exam-costa-api:v1.5.0" -> "371670420772.dkr.ecr.us-east-2.amazonaws.com/exam-costa-api:v2.0.0"
      ~ worker_image = "371670420772.dkr.ecr.us-east-2.amazonaws.com/exam-costa-worker:v1.5.0" -> "371670420772.dkr.ecr.us-east-2.amazonaws.com/exam-costa-worker:v2.0.0"
        # (5 unchanged attributes hidden)
    }
  ~ quick_access               = {
      ~ api_endpoint             = "http://exam-costa-production-alb-1198617444.us-east-2.elb.amazonaws.com" -> "https://exam-costa-production-alb-1198617444.us-east-2.elb.amazonaws.com"
      ~ health_endpoint          = "http://exam-costa-production-alb-1198617444.us-east-2.elb.amazonaws.com/healthz" -> "https://exam-costa-production-alb-1198617444.us-east-2.elb.amazonaws.com/healthz"
        # (3 unchanged attributes hidden)
    }
  ~ worker_task_definition_arn = "arn:aws:ecs:us-east-2:371670420772:task-definition/exam-costa-production-worker:2" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>